#+title: Current Emacs configuration
#+author: Simon Meyer
Don't forget to check =init.el= and =early-init.el= for what comes before (such as =use-package= setup, sources and removing useless UI elements).
** All the icons
Package =all-the-icons= provides all the necessary icons to make everything nice and pretty. It provides icons for treemacs, the modeline and everything else. Don't forget to run =M-x all-the-icons-install-fonts= the first time to install all the fonts!
More info is available here: https://github.com/domtronn/all-the-icons.el
#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))


  (use-package all-the-icons-completion)
  (run-with-timer 2 nil #'all-the-icons-completion-mode)  

 #+END_SRC

#+RESULTS:
: [nil 25691 14272 274889 nil all-the-icons-completion-mode nil nil 200000 nil]


** Rainbow delimiters
Parentheses can be a real pain, so we use the color-coding to help identify who is who. We only use this in programming modes however as it can easily become distracting or irritating if we are only taking notes.
Documentation here: https://github.com/Fanael/rainbow-delimiters
#+BEGIN_SRC emacs-lisp
(use-package rainbow-delimiters
  :diminish rainbow-delimiters-mode
  :hook (prog-mode . rainbow-delimiters-mode))
#+END_SRC

#+RESULTS:
| rainbow-delimiters-mode |

** Sane defaults
The defaults in Emacs aren't considered /sane/ because they have been this way a long time, and the Emacs community is very slow to change these things. We will therefore change them to something friendlier. It's a big mess of things that will generally improve your quality of life.
#+BEGIN_SRC emacs-lisp

  ;; Let's disable all the scroll bars
  (scroll-bar-mode -1)

  ;; Don't beep at me
  (setq visible-bell t)
  ;; Answering just 'y' or 'n', instead of 'yes' and 'no' will do
  (defalias 'yes-or-no-p 'y-or-n-p)

  ;; Keep all backup and auto-save files in one directory
  (setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
  (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))

  ;; UTF-8 please
  (setq locale-coding-system 'utf-8) ; pretty
  (set-terminal-coding-system 'utf-8) ; pretty
  (set-keyboard-coding-system 'utf-8) ; pretty
  (set-selection-coding-system 'utf-8) ; please
  (prefer-coding-system 'utf-8) ; with sugar on top

  ;; Turn off the blinking cursor
  (blink-cursor-mode -1)

  (setq-default indent-tabs-mode nil) ; no let's use spaces
  (setq-default indicate-empty-lines t)

  ;; Don't count two spaces after a period as the end of a sentence.
  ;; Just one space is needed.
  (setq sentence-end-double-space nil)

  ;; delete the region when typing, just like as we expect nowadays.
  (delete-selection-mode t)
  ;; Highlight the corresponding opening/closing parentheses when the cursor is on one of them
  (show-paren-mode t)
  ;; Add the column number to the modeline
  (column-number-mode t)
  ;; Enables softwrapping of lines (puts all the text on screen) 
  (global-visual-line-mode)
  ;; Shows file paths with forward slashes (as expected on Unix systems)
  (setq uniquify-buffer-name-style 'forward)

  ;; -i gets alias definitions from .bash_profile
  (setq shell-command-switch "-i")

  ;; Map escape to cancel (like C-g)...
  (define-key isearch-mode-map [escape] 'isearch-abort)   ;; isearch
  (define-key isearch-mode-map "\e" 'isearch-abort)   ;; \e seems to work better for terminals
  (global-set-key [escape] 'keyboard-escape-quit)         ;; everywhere else

  ;; Keep files up to date when they change on disk
  (global-auto-revert-mode t)

  ;; Docview continuous scroll
  (setq doc-view-continuous t)

  ;; Enable winner-mode
  (winner-mode 1);

  ;; Use ripgrep
  (use-package rg)

  (grep-apply-setting
   'grep-find-command
   '("rg -n -H --no-heading -e '' $(git rev-parse --show-toplevel || pwd)" . 27)
   )
#+END_SRC

#+RESULTS:
: (rg -n -H --no-heading -e '' $(git rev-parse --show-toplevel || pwd) . 27)

** Basic org-mode functionnality
Here we establish the basic Org-mode functionality. While complicated, it is mostly plagiarized from David Wilson's "Emacs from scratch" excellent video series. You can find the config here: https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org ! In our case we simply load =org-mode= here and setup fonts, agenda location, and centers the buffer if used in full screen to lessen eye strain. We also use =pretty-bullets= just for /aesthetic/ purposes.
#+BEGIN_SRC emacs-lisp
     (defun efs/org-mode-setup ()
     (org-indent-mode)
     (variable-pitch-mode 1)
     (evil-org-mode 1)
     (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
     ;(setq org-agenda-include-diary t))

   (defun efs/org-font-setup () ;; Replace list hyphen with dot
     (font-lock-add-keywords 'org-mode
                             '(("^ *\\([-]\\) "
                                (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

     ;; Set faces for heading levels
     (dolist (face '((org-level-1 . 1.2)
                     (org-level-2 . 1.1)
                     (org-level-3 . 1.05)
                     (org-level-4 . 1.0)
                     (org-level-5 . 1.1)
                     (org-level-6 . 1.1)
                     (org-level-7 . 1.1)
                     (org-level-8 . 1.1)))
       (set-face-attribute (car face) nil :font "Roboto" :weight 'regular :height (cdr face)))

     ;; Ensure that anything that should be fixed-pitch in Org files appears that way
     (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
     (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
     (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
     (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
     (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
     (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
     (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

   ;; ;(setq calendar-week-start-day 0
   ;;       calendar-day-name-array ["Dimanche" "Lundi" "Mardi" "Mercredi" "Jeudi" "Vendredi" "Samedi"]
   ;;       calendar-month-name-array ["Janvier" "Février" "Mars" "Avril" "Mai" "Juin" "Juillet" "Août" "Septembre"
   ;;                                  "Octobre" "Novembre" "Décembre"])
   (use-package org
     :hook ((org-mode . efs/org-mode-setup))
     :config
      (setq org-ellipsis " ⤵")
      (efs/org-font-setup)
      (setq org-agenda-start-with-log-mode t)
      (setq org-log-done 'time)

      (setq org-done-into-drawer t)
      (setq org-agenda-files
            '("~/Agenda/" "~/Documents/RoamNotes/" "~/org/todo.org"))
      (setq org-todo-keywords
            '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!")
              (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVATE(a)" "REVIEW(v)" "WAIT(w@/!)" "|" "COMPLETED(c)" "CANCELLED(k@)")))
     ;; Configure custom agenda views
      (setq org-agenda-custom-commands
       '(("d" "Dashboard"
         ((agenda "" ((org-deadline-warning-days 7)))
          (todo "NEXT"
            ((org-agenda-overriding-header "Next Tasks")))
          (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

        ("n" "Next Tasks"
         ((todo "NEXT"
            ((org-agenda-overriding-header "Next Tasks")))))

        ("W" "Work Tasks" tags-todo "+work-email")

        ;; Low-effort next actions
        ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
         ((org-agenda-overriding-header "Low Effort Tasks")
          (org-agenda-max-todos 20)
          (org-agenda-files org-agenda-files)))

        ("w" "Workflow Status"
         ((todo "WAIT"
                ((org-agenda-overriding-header "Waiting on External")
                 (org-agenda-files org-agenda-files)))
          (todo "REVIEW"
                ((org-agenda-overriding-header "In Review")
                 (org-agenda-files org-agenda-files)))
          (todo "PLAN"
                ((org-agenda-overriding-header "In Planning")
                 (org-agenda-todo-list-sublevels nil)
                 (org-agenda-files org-agenda-files)))
          (todo "BACKLOG"
                ((org-agenda-overriding-header "Project Backlog")
                 (org-agenda-todo-list-sublevels nil)
                 (org-agenda-files org-agenda-files)))
          (todo "READY"
                ((org-agenda-overriding-header "Ready for Work")
                 (org-agenda-files org-agenda-files)))
          (todo "ACTIVE"
                ((org-agenda-overriding-header "Active Projects")
                 (org-agenda-files org-agenda-files)))
          (todo "COMPLETED"
                ((org-agenda-overriding-header "Completed Projects")
                 (org-agenda-files org-agenda-files)))
          (todo "CANC"
                ((org-agenda-overriding-header "Cancelled Projects")
                 (org-agenda-files org-agenda-files)))))))
      (efs/org-font-setup))

   (defun efs/org-mode-visual-fill ()
     (setq visual-fill-column-width 120
           visual-fill-column-center-text t)
     (visual-fill-column-mode 1))

   (use-package org-bullets
      :after org
      :hook (org-mode . org-bullets-mode)
      :custom
      (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

  (use-package visual-fill-column
    :hook ((org-mode . efs/org-mode-visual-fill)
           (latex-mode . efs/org-mode-visual-fill)
           (LaTeX-mode . efs/org-mode-visual-fill)))

  (setq org-use-speed-commands t)
  (setq org-image-actual-width 550)
  (setq org-highlight-latex-and-related '(latex script entities))
#+END_SRC

#+RESULTS:
| latex | script | entities |

Lets add image animation to this configuration
#+begin_src emacs-lisp
  (use-package org-inline-anim)
  (add-hook 'org-mode-hook #'org-inline-anim-mode)
#+end_src

#+RESULTS:
| org-ref-org-menu | (lambda nil evil-org-mode) | org-tempo-setup | org-inline-anim-mode | efs/org-mode-visual-fill | org-bullets-mode | efs/org-mode-setup | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** Get latest Calendar at emacs startup
#+begin_src emacs-lisp
  (call-process "/usr/bin/icsorg")
(add-hook 'org-agenda-mode-hook (lambda () (call-process "/usr/bin/icsorg")))
#+end_src

#+RESULTS:
| lambda | nil | (call-process /usr/bin/icsorg) |

** Source block templates
These are just some nice templates to shorten the time needed to write some structures. Not too needed since =yasnippet= is here to help.
#+BEGIN_SRC emacs-lisp
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("sh" . "src sh"))
#+END_SRC

#+RESULTS:
: ((sh . src sh) (py . src python) (el . src emacs-lisp) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))

** Extra keybindings 
Let's add a few keybindings to help along with capture and agenda. More importantly lets add =evil-org= to enable even more nice (and evil) keybindings to be used. The documentation can be found here: https://github.com/Somelauw/evil-org-mode
#+BEGIN_SRC emacs-lisp
(bind-key "C-c c" 'org-capture)
(bind-key "C-c a" 'org-agenda)

(use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

#+END_SRC

#+RESULTS:
| org-ref-org-menu | (lambda nil evil-org-mode) | org-tempo-setup | org-inline-anim-mode | efs/org-mode-visual-fill | org-bullets-mode | efs/org-mode-setup | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** Org-ref
Org-ref comes with org-mode already, all we need to do is to set it up properly
#+begin_src emacs-lisp
  (use-package bibtex-completion)
  (use-package org-ref)
  (setq bibtex-completion-bibliography'("~/bib/references.bib")
        bibtex-completion-library-path '("")
        bibtex-completion-notes-path "~/bib/pdf/"
        bibtex-completion-notes-template-multiple-files "* ${author-or-editor}, ${title}, ${journal}, (${year}) :${=type=}: \n\nSee [[cite:&${=key=}]]\n"

        bibtex-completion-additional-search-fields '(keywords)
        bibtex-completion-display-formats
        '((article       . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${journal:40}")
          (inbook        . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} Chapter ${chapter:32}")
          (incollection  . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
          (inproceedings . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*} ${booktitle:40}")
          (t             . "${=has-pdf=:1}${=has-note=:1} ${year:4} ${author:36} ${title:*}"))
        bibtex-completion-pdf-open-function
        (lambda (fpath)
          (call-process "open" nil 0 nil fpath)))
#+end_src

            #+RESULTS:
            | lambda | (fpath) | (call-process open nil 0 nil fpath) |

** Org capture templates
Here we create org-capture templates for quick and easy note taking
#+BEGIN_SRC emacs-lisp
(setq org-capture-templates
    '(("t" "Todo" entry (file+headline "~/org/todo.org" "Tasks")
       "* TODO %?\n  %i\n  %a")
      ("j" "Journal" entry (file+datetree "~/org/journal.org")
       "* %?\nEntered on %U\n  %i\n  %a")))
#+END_SRC

#+RESULTS:
| t | Todo | entry | (file+headline ~/org/todo.org Tasks) | * TODO %? |

* Programming languages support
Delegating is sometimes necessary, isn't it? Here we are delegating most of our programming completions to lsp servers with =eglot=. Quite useful, isn't it?
#+BEGIN_SRC emacs-lisp
      (use-package eglot
        :commands (eglot eglot-ensure)
        :hook (
               (c-mode . eglot-ensure)
               (c++-mode . eglot-ensure)
               (python-mode . eglot-ensure)
               (latex-mode . eglot-ensure)
               (xenops-mode . eglot-ensure)))
(add-hook 'eglot-managed-mode-hook #'eldoc-box-hover-mode t)

  #+END_SRC

#+RESULTS:
| doom-modeline-override-eglot | doom-modeline-update-eglot | eldoc-box-hover-mode |

* Email and calendar support
Here we add email support in emacs, in order to manage multiple accounts. We use offlineIMAP and notmuch to manage these.
#+BEGIN_SRC emacs-lisp
      (use-package notmuch
        :demand t
        :ensure t
        :bind (:map notmuch-message-mode-map
                    ("C-c C-c" . set-smtp-server-message-send-and-exit))
        )  
      (setq smtp-accounts          ;; Format: Sender Mail address - SMTP Server - Port - Username
              '(("simeyer@protonmail.com" "127.0.0.1" 1025 "simeyer@protonmail.com")
                ("simon.meyer@bmedicalsystems.com" "mail.bmedicalsystems.com" 587 "simon.meyer")))

        (defun set-smtp-server-message-send-and-exit ()
        "Set SMTP server from list of multiple ones and send mail."
        (interactive)
        (message-remove-header "X-Message-SMTP-Method") ;; Remove. We always determine it by the From field
        (let ((sender
               (message-fetch-field "From")))
          (cl-loop for (addr server port usr) in smtp-accounts
                when (string-match addr sender)
                do (message-add-header (format "X-Message-SMTP-Method: smtp %s %d %s" server port usr)))
          (let ((xmess
                 (message-fetch-field "X-Message-SMTP-Method")))
            (if xmess
                (progn
                  (message (format "Sending message using '%s' with config '%s'" sender xmess))
                  (message-send-and-exit))
              (error "Could not find SMTP Server for this Sender address: %s. You might want to correct it or add it to the SMTP Server list 'smtp-accounts'" sender)))))


      (setq starttls-use-gnutls t)
      (setq starttls-gnutls-program "gnutls-cli")
      (setq starttls-extra-arguments nil)

  (setq message-send-mail-function 'smtpmail-send-it)
  (defvar notmuch-unread-mode-line-string "")
  (defvar notmuch-unread-email-count nil)
  (defconst my-mode-line-map (make-sparse-keymap))
  (defun notmuch-unread-count ()
    (setq notmuch-unread-email-count
          (string-to-number
           (replace-regexp-in-string
            "\n" "" (notmuch-command-to-string
                     "count" "tag:unread"))))
    (if (eq notmuch-unread-email-count 0)
        (setq notmuch-unread-mode-line-string "  ")
      (setq notmuch-unread-mode-line-string (format "  %d " notmuch-unread-email-count)))
    (force-mode-line-update))

  (run-at-time nil 10 #'notmuch-unread-count)

    (defun notmuch-open-emails ()
      (interactive)
      (if (eq notmuch-unread-email-count 0) (notmuch-search "*") (notmuch-search "tag:inbox")))
  (setq global-mode-string 
          (append global-mode-string (list '(:eval (propertize notmuch-unread-mode-line-string 'help-echo "notmuch emails" 'mouse-face 'mode-line-highlight 'local-map my-mode-line-map)))))
     (define-key my-mode-line-map 
       (vconcat [mode-line down-mouse-1])
       (cons "hello" 'notmuch-open-emails))
#+END_SRC

#+RESULTS:
: (hello . notmuch-open-emails)

Here we add calendar support:
#+begin_src emacs-lisp
  ;; Fetch calendar
;  (run-at-time nil 60 (lambda () (shell-command "curl https://mail.bmedicalsystems.com/owa/calendar/b53767f6ee15411f9f3f9e76b1a1fcd0@bmedicalsystems.com/ebbfea6375454f6fa75db99e4905fa5716775956803368869501/calendar.ics > /home/simon/calendar.ics &" nil nil)))
#+end_src

#+RESULTS:

